# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [3]:
data = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
data.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

In [12]:
data.head(10)

   Unnamed: 0      Name  Year Gender State  Count
0       11349      Emma  2004      F    AK     62
1       11350   Madison  2004      F    AK     48
2       11351    Hannah  2004      F    AK     46
3       11352     Grace  2004      F    AK     44
4       11353     Emily  2004      F    AK     41
5       11354   Abigail  2004      F    AK     37
6       11355    Olivia  2004      F    AK     33
7       11356  Isabella  2004      F    AK     30
8       11357    Alyssa  2004      F    AK     29
9       11358    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [13]:
del(data[['Id','Unnamed: 0']])
data.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [42]:
data1 = data.groupby('Gender').size().reset_index()
data1.columns= [['gender','count']]
data1.head()
max = data1['count'].max()
data1[data1['count'] == max].gender
#data1['gender']

0    F
Name: gender, dtype: object

### Step 7. Group the dataset by name and assign to names

In [47]:
data.head()
names = data.groupby('Name')
names

### Step 8. How many different names exist in the dataset?

In [63]:
names.size().reset_index().Name.value_counts().count()

17632

### Step 9. What is the name with most occurrences?

In [119]:
data1 = names.size().reset_index()
data1.columns = [['Name','Counts']]
max = data1['Counts'].max()
data1[data1['Counts'] == max].Name

14062    Riley
Name: Name, dtype: object

### Step 10. How many different names have the least occurrences?

In [93]:
min = data1.sort_values(by = 'Counts',ascending = True).head(1).iloc[0,1]
data1[data1['Counts'] == min].Name.value_counts().count()
#min

3682

### Step 11. What is the median name occurrence?

In [105]:
median = round(data1.Counts.median(),1)
data1[data1['Counts'] == median].Name

196       Abubakar
290         Adelie
326          Adira
384        Adylene
395         Aerial
469         Aidric
567          Akari
615         Alaiya
637          Alara
664         Alazay
681          Alder
690         Aleana
733        Aleksey
840           Alin
902        Alliana
932           Alon
968           Alyn
986         Alysse
1050     Amaryllis
1069        Ambree
1083         Ameir
1097          Amer
1188         Amyri
1317        Andrae
1337      Andriana
1360         Anely
1494        Annahi
1531         Annel
1564        Anshul
1575       Anthoni
           ...
16290         Tuff
16492        Vanna
16648         Vlad
16680       Waseem
16748      Willian
16771      Woodrow
16821     Xitlalli
16837      Xzander
16873        Yaira
16880       Yakira
16928        Yanni
16931       Yanuel
16936        Yared
16969      Yaritzi
17072       Yishai
17088       Yliana
17119         Yoni
17120        Yonis
17159     Ysabelle
17166       Yudith
17168          Yug
17184       Yuliza
17193       Yunuen
17218       Yvanna
17312        Zakia
17336       Zamaya
17352       Zanaya
17377         Zari
17425       Zaylie
17596       Zyanna
Name: Name, Length: 360, dtype: object

### Step 12. What is the standard deviation of names?

In [111]:
std = round(data1.Counts.std(),5)
data1[data1['Counts'] == median].Name
std

122.02996

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [109]:
data1.describe()

             Counts
count  17632.000000
mean      57.644907
std      122.029964
min        1.000000
25%        2.000000
50%        8.000000
75%       39.000000
max     1112.000000